{
  "firstName": "Srinivas",
  "lastName": "Mekala",
  "email": "srinivasmekala1227@gmail.com",
  "phone": "123-456-7890",
  "homePageSubText": "I am a full stack developer with a passion for creating beautiful and functional user experiences.",
  "introduction": [
    "Hi, I’m Srinivas Mekala—an aspiring Software Engineer with a passion for backend development, distributed systems, and creating scalable, reliable solutions. I enjoy diving into complex challenges, whether it’s designing efficient microservices, optimizing database performance, or building applications that make life easier (and sometimes cooler).",
    "I’ve honed my skills through hands-on experience working with cutting-edge technologies like Python, Flask, MongoDB, Docker, Kubernetes, and AWS. My journey has taken me from crafting real-time chat systems to integrating APIs from health insurers and even leading development for innovative projects like ArtKart and Chatopia",
    "Beyond coding, I’m a curious learner, mentor at Hackerabad, community organizer, and even dabbled in event management for CodeDay Hyderabad. When I’m not coding, you can find me exploring bakeries and cafe`s, watching movies, or trying to perfect the art of balancing coffee cups and deadlines. Let’s connect and build something amazing together!"
  ],
  "socialLinks": [
    {
      "name": "linkedin",
      "url": "https://www.linkedin.com/in/sri-nivas1227/"
    },
    {
      "name": "github",
      "url": "https://github.com/sri-nivas1227"
    },
    {
      "name": "twitter",
      "url": "https://twitter.com/sri_nivas1227"
    }
  ],
  "education": [
    {
      "school": "University at Albany, New York",
      "degree": "M.S. in Computer Science",
      "graduationDate": "May 2026"
    },
    {
      "school": "Sreenidhi Institute of Sience and Technology, Hyderabad",
      "degree": "B.Tech in Electronics and Computer Engineering",
      "graduationDate": "May 2023"
    }
  ],
  "workExperience": [
    {
      "order": 3,
      "company": "Kalakumbh Arthub Pvt. Ltd., Remote",
      "position": "Backend Engineer Intern",
      "startDate": "March 2023",
      "endDate": "July 2023",
      "description": "-- Developed Backend server using Python and Flask to support core features of a social media platform for musicians and singers. -- Utilized MongoDB for the primary database and implemented Redis for efficient cache management, optimizing server performance. -- Built and integrated user authentication using Twilio services, ensuring secure user login and account management. -- Implemented real-time chat functionality using SocketIO to facilitate seamless communication between users. -- Managed server testing and deployment processes, ensuring stability and performance on AWS EC2. -- Leveraged Docker for containerization, streamlining development, testing, and production workflows. -- Collaborated with team members using Git and GitHub for version control and code management.",
      "companyIcon": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/kalakumbh.jpg"
    },
    {
      "order": 2,
      "company": "OneAssure, Prost Insurance Technologies Pvt. Ltd., Bengaluru, Karnataka, India",
      "position": "Software Engineer Intern",
      "startDate": "July 2023",
      "endDate": "November 2023",
      "description": "-- Developed a new, responsive user interface for the application using Next.js, Tailwind CSS, and Redux, improving user engagement and performance. -- Collaborated with the backend team to integrate APIs from major health insurers, extending the functionality of the application. -- Contributed to cross-functional team discussions to align front-end development with overall project goals and back-end services. -- Gained hands-on experience in full-stack development, working in an Agile environment to deliver scalable and maintainable solutions. -- Actively participated in code reviews and team meetings, contributing ideas to improve coding standards and software architecture. -- Technologies worked on: Flask, Python, MongoDB, Docker, Next.JS, Google Firebase, TailwindCSS etc..",
      "companyIcon": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/OneAssure.png"
    },
    {
      "order": 1,
      "company": "OneAssure, Prost Insurance Technologies Pvt. Ltd., Bengaluru, Karnataka, India",
      "position": "Software Engineer",
      "startDate": "November 2023",
      "endDate": "July 2024",
      "description": "-- Developed and maintained scalable microservices for user and admin functionalities using Flask and MongoDB. -- Implemented Role-Based Access Control (RBAC) to enhance security and streamline application management. -- Designed and deployed containerized applications using Docker, Kubernetes, and AWS, ensuring reliability and scalability. -- Integrated external APIs from health insurers to expand features and improve user interactions. -- Refactored legacy code, adhering to industry best practices for maintainability and performance optimization",
      "companyIcon": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/OneAssure.png"
    }
  ],
  "skills": [
    {
      "category": "Languages",
      "items": ["Python", "JavaScript", "Java"]
    },
    {
      "category": "Frontend",
      "items": ["React", "Next.js", "Tailwind CSS", "Redux", "HTML", "CSS"]
    },
    {
      "category": "Backend",
      "items": ["Flask", "Node.js", "Express", "MongoDB", "PostgreSQL"]
    },
    {
      "category": "DevOps",
      "items": ["Docker", "AWS", "Git", "GitHub"]
    },
    {
      "category": "Tools",
      "items": ["VS Code", "Postman", "Jira", "Confluence", "Slack"]
    }
  ],
  "projects": [
    {
      "order": 1,
      "title": "CareerMate",
      "tagline": "A Personalized Application to Streamline Job Search",
      "logo": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/finbuddy.png",
      "preview_link": "#",
      "github_link": "https://github.com/sri-nivas1227/CareerMate",
      "preview_image": "https://i.imgur.com/JA8pzzV.jpg",
      "description": "A full-stack web application built with MERN stack, that helps users track their income, expenses. Users can create accounts, log transactions, and view detailed reports to manage their finances effectively. Integrated a calculator feature into the broader application workflow."
    },
    {
      "order": 3,
      "title": "FinBuddy",
      "tagline": "Personal Finance Tracker",
      "logo": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/finbuddy.png",
      "preview_link": "https://finbuddy-app.netlify.app/",
      "github_link": "https://github.com/sri-nivas1227/finbuddy-frontend",
      "preview_image": "https://i.imgur.com/JA8pzzV.jpg",
      "description": "A full-stack web application built with MERN stack, that helps users track their income, expenses. Users can create accounts, log transactions, and view detailed reports to manage their finances effectively. Integrated a calculator feature into the broader application workflow."
    },
    {
      "order": 4,
      "title": "AirBnb",
      "tagline": "A front-end clone of AirBnb",
      "logo": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/airbnb.png",
      "preview_link": "https://srinivas-air-bnb-clone.netlify.app/",
      "github_link": "https://github.com/sri-nivas1227/airbnb-clone",
      "preview_image": "https://i.imgur.com/1Z2ZQ8V.jpg",
      "description": "A front-end clone of the popular AirBnb website, featuring a responsive design, interactive map, and search functionality. Users can view listings, filter by location and price, and explore detailed property information. Built with React, Tailwind CSS, and Mapbox for the map component."
    },
    {
      "order": 5,
      "title": "Chatopia",
      "tagline": "Chat Application",
      "logo": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/chatopia.png",
      "github_link": "https://github.com/sri-nivas1227/chatopia-frontend",
      "preview_link": "https://chatopia-app.netlify.app/",
      "preview_image": "https://i.imgur.com/1Z2ZQ8V.jpg",
      "description": "A real-time chat application that allows users to create chat rooms, send messages, and engage in group conversations. Users can join public rooms, create private rooms, and view message history. Implemented using Socket.IO for real-time communication, with a React frontend and a Flask backend."
    },
    {
      "order": 6,
      "title": "Portfolio",
      "tagline": "My Personal Website",
      "logo": "https://sri-misc-bucket.s3.us-east-2.amazonaws.com/portfolio/portfolio-icon.png",
      "preview_link": "https://srinivas-mekala.netlify.app/",
      "github_link": "https://github.com/sri-nivas1227/sri-nivas1227",
      "preview_image": "https://i.imgur.com/1Z2ZQ8V.jpg",
      "description": "You are currently viewing it! Built with Next.js, Tailwind CSS, and deployed on Netlify."
    }
  ]
}
